#!/bin/python3.9
# Вывести первое число в строке
user_input = int(input('введите число: '))
a = user_input
print(a // 100)
