#!/bin/python3.9
# Вывести последнее число в строке
user_input = int(input('введите число: '))
a = user_input
print(a % 10)

#!/bin/python3.9
# Вывести последнее число в строке
user_input = input('введите число: ')
print(user_input[-1])